package kz.tutorial.jsonplaceholdertypicode.presentation.users

class UserProfileFragment {
    //TODO: Нужно сделать запрос на https://jsonplaceholder.typicode.com/users/{userId}
// Моделька у вас уже есть
    // Дальше вам нужно просто создать экран отображения пользователей по фигме и нашей архитектуре
    //Рекомендую идти снизу вверх по древу зависимостей
    //Также, не забываем про клик на имейл, website, show on map

    //TODO: Советую попробовать и сделать доп задание:
    //1: Передавать на экран сразу объект UserShort через safeArgs и потом качать дополнительные данные по апишке

    //2: Добавить переход из любого места (пост, альбом, фото) в приложении при нажатии на username
}